#### Terraform Format and Style 🖌`success`
#### dev Terraform Initialization ⚙️`success`
#### dev Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### dev Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mdata.terraform_remote_state.shared_services: Refreshing state...[0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.random_string.base: Refreshing state... [id=yZQ2][0m
[0m[1mmodule.linux_web_app.module.app_service.random_string.base: Refreshing state... [id=KlPU][0m
[0m[1mmodule.linux_web_app.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.boot_diag_storage.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus][0m
[0m[1mmodule.network_spoke.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus][0m
[0m[1mmodule.linux_web_app.module.app_service_plan.azurerm_app_service_plan.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus/providers/Microsoft.Web/serverfarms/asp-linux-dev-eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network.azurerm_virtual_network.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.public_ip.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/publicIPAddresses/pip-agw-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.user_assigned_identity.azurerm_user_assigned_identity.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourcegroups/rg-aks-dev-eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-aks-dev-eastus][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.azurerm_storage_account.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-dev-eastus/providers/Microsoft.Storage/storageAccounts/stdiagdeyzq2eastus][0m
[0m[1mmodule.linux_web_app.module.app_service.azurerm_app_service.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-linux-web-app-dev-eastus/providers/Microsoft.Web/sites/app-testklpu-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-master-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.subnet.azurerm_subnet.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-k8s-node-dev-eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network_peering_hub.azurerm_virtual_network_peering.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/virtualNetworkPeerings/vnet-transit-hub-shared-services-eastus-to-vnet-spoke-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-agw-dev-eastus][0m
[0m[1mmodule.network_spoke.module.virtual_network_peering_spoke.azurerm_virtual_network_peering.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/virtualNetworkPeerings/vnet-spoke-dev-eastus-to-vnet-transit-hub-shared-services-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.subnet.azurerm_subnet.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-aks-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_1.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourcegroups/rg-aks-dev-eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/bbb4bf02-0fc9-a6a9-be2c-3c9aebe020b3][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_3.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/0233663b-e549-8aac-6f4e-73272f925ec0][0m
[0m[1mmodule.k8s_cluster.module.lb_k8s_master.azurerm_lb.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.lb_k8s_node.azurerm_lb.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_0.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-spoke-dev-eastus/providers/Microsoft.Network/virtualNetworks/vnet-spoke-dev-eastus/subnets/snet-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/c9eaf8bb-28a1-ac49-25db-3eae7c4daba1][0m
[0m[1mmodule.k8s_cluster.module.lb_backend_address_pool_k8s_node.azurerm_lb_backend_address_pool.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m
[0m[1mmodule.aks_agw_ingress.module.aks.azurerm_kubernetes_cluster.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourcegroups/rg-aks-dev-eastus/providers/Microsoft.ContainerService/managedClusters/aks-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.module.application_gateway.azurerm_application_gateway.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/applicationGateways/agw-aks-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.lb_backend_address_pool_k8s_master.azurerm_lb_backend_address_pool.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-01-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.aks_agw_ingress.module.role_assignment_aks_2.azurerm_role_assignment.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-aks-dev-eastus/providers/Microsoft.Network/applicationGateways/agw-aks-dev-eastus/providers/Microsoft.Authorization/roleAssignments/58f4caeb-3698-f230-3c26-d9594780700a][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s_master-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s_master-00-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s_master-dev-eastus/backendAddressPools/beap-k8s_master][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-00-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-00-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m
[0m[1mmodule.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/networkInterfaces/nic-lvm-k8s-node-01-dev-eastus/ipConfigurations/ip-nic-lvm-k8s-node-01-dev-eastus|/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Network/loadBalancers/lbi-k8s-node-dev-eastus/backendAddressPools/beap-k8s-node][0m
[0m[1mmodule.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-node-01-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-node-00-dev-eastus][0m
[0m[1mmodule.k8s_cluster.module.virtual_machine_k8s_master.azurerm_linux_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-k8s-cluster-dev-eastus/providers/Microsoft.Compute/virtualMachines/lvm-k8s-master-00-dev-eastus][0m
[0m[1mmodule.aks_agw_ingress.null_resource.aks_config: Refreshing state... [id=3440776425056365020][0m
[0m[1mmodule.aks_agw_ingress.helm_release.ingress_azure: Refreshing state... [id=application-gateway-kubernetes][0m
[0m[1mmodule.aks_agw_ingress.null_resource.aks_test_app: Refreshing state... [id=4963124599666372037][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.bastion.module.bastion.azurerm_bastion_host.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_bastion_host" "base" {
      [32m+[0m [0m[1m[0mdns_name[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "bastion-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-bastion-dev-eastus"

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                 = "ip-bastion-dev-eastus"
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
        }
    }

[1m  # module.bastion.module.bastion.azurerm_subnet.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.1.5.0/24",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "AzureBastionSubnet"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-spoke-dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-spoke-dev-eastus"
    }

[1m  # module.bastion.module.public_ip.azurerm_public_ip.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_public_ip" "base" {
      [32m+[0m [0m[1m[0mallocation_method[0m[0m       = "Static"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m = 4
      [32m+[0m [0m[1m[0mip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mip_version[0m[0m              = "IPv4"
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "pip-bastion-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-bastion-dev-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0mtags[0m[0m                    = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.bastion.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-bastion-dev-eastus"
    }

[0m[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: ./devtfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "./devtfplan"

```

</details>

*Pusher: @kuhlman-labs, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI/CD`*